Revit 2026 API

# ExportEnergyModelType Enumeration

---

This enum is used to define if energy model used for gbXML export should be based on rooms/spaces, building elements or analysis mode in EnergyDataSettings.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ExportEnergyModelType
```
```vb
Public Enumeration ExportEnergyModelType
```
```cpp
public enum class ExportEnergyModelType
```
```fsharp
type ExportEnergyModelType
```

| Member name | Value | Description |
| --- | --- | --- |
| AnalysisMode | 2 | Energy model based on analysis mode in EnergyDataSettings. |
| BuildingElement | 1 | The building element based energy analytical model. |
| SpatialElement | 0 | Energy model based on rooms or spaces. |

#### Reference

Autodesk.Revit.DB Namespace